RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/osd_draw_l_reg.h
/**
  ******************************************************************************
  * @file    osd_draw_l_reg.h
  * @version V1.0
  * @date    2021-06-28
  * @brief   This file is the description of.IP register
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
#ifndef __OSD_DRAW_L_REG_H__
#define __OSD_DRAW_L_REG_H__

#include "bl808.h"

/* 0x0 : osd_draw_config */
#define OSD_DRAW_L_OSD_DRAW_CONFIG_OFFSET (0x0)
#define OSD_DRAW_L_REG_DRAW_EN_L          OSD_DRAW_L_REG_DRAW_EN_L
#define OSD_DRAW_L_REG_DRAW_EN_L_POS      (0U)
#define OSD_DRAW_L_REG_DRAW_EN_L_LEN      (16U)
#define OSD_DRAW_L_REG_DRAW_EN_L_MSK      (((1U << OSD_DRAW_L_REG_DRAW_EN_L_LEN) - 1) << OSD_DRAW_L_REG_DRAW_EN_L_POS)
#define OSD_DRAW_L_REG_DRAW_EN_L_UMSK     (~(((1U << OSD_DRAW_L_REG_DRAW_EN_L_LEN) - 1) << OSD_DRAW_L_REG_DRAW_EN_L_POS))
#define OSD_DRAW_L_REG_DRAW_TYPE_L        OSD_DRAW_L_REG_DRAW_TYPE_L
#define OSD_DRAW_L_REG_DRAW_TYPE_L_POS    (16U)
#define OSD_DRAW_L_REG_DRAW_TYPE_L_LEN    (16U)
#define OSD_DRAW_L_REG_DRAW_TYPE_L_MSK    (((1U << OSD_DRAW_L_REG_DRAW_TYPE_L_LEN) - 1) << OSD_DRAW_L_REG_DRAW_TYPE_L_POS)
#define OSD_DRAW_L_REG_DRAW_TYPE_L_UMSK   (~(((1U << OSD_DRAW_L_REG_DRAW_TYPE_L_LEN) - 1) << OSD_DRAW_L_REG_DRAW_TYPE_L_POS))

/* 0x4 : draw_partial_yuv_config0 */
#define OSD_DRAW_L_DRAW_PARTIAL_YUV_CONFIG0_OFFSET (0x4)
#define OSD_DRAW_L_REG_DRAW_TH_00                  OSD_DRAW_L_REG_DRAW_TH_00
#define OSD_DRAW_L_REG_DRAW_TH_00_POS              (0U)
#define OSD_DRAW_L_REG_DRAW_TH_00_LEN              (8U)
#define OSD_DRAW_L_REG_DRAW_TH_00_MSK              (((1U << OSD_DRAW_L_REG_DRAW_TH_00_LEN) - 1) << OSD_DRAW_L_REG_DRAW_TH_00_POS)
#define OSD_DRAW_L_REG_DRAW_TH_00_UMSK             (~(((1U << OSD_DRAW_L_REG_DRAW_TH_00_LEN) - 1) << OSD_DRAW_L_REG_DRAW_TH_00_POS))
#define OSD_DRAW_L_REG_DRAW_V_00                   OSD_DRAW_L_REG_DRAW_V_00
#define OSD_DRAW_L_REG_DRAW_V_00_POS               (8U)
#define OSD_DRAW_L_REG_DRAW_V_00_LEN               (8U)
#define OSD_DRAW_L_REG_DRAW_V_00_MSK               (((1U << OSD_DRAW_L_REG_DRAW_V_00_LEN) - 1) << OSD_DRAW_L_REG_DRAW_V_00_POS)
#define OSD_DRAW_L_REG_DRAW_V_00_UMSK              (~(((1U << OSD_DRAW_L_REG_DRAW_V_00_LEN) - 1) << OSD_DRAW_L_REG_DRAW_V_00_POS))
#define OSD_DRAW_L_REG_DRAW_U_00                   OSD_DRAW_L_REG_DRAW_U_00
#define OSD_DRAW_L_REG_DRAW_U_00_POS               (16U)
#define OSD_DRAW_L_REG_DRAW_U_00_LEN               (8U)
#define OSD_DRAW_L_REG_DRAW_U_00_MSK               (((1U << OSD_DRAW_L_REG_DRAW_U_00_LEN) - 1) << OSD_DRAW_L_REG_DRAW_U_00_POS)
#define OSD_DRAW_L_REG_DRAW_U_00_UMSK              (~(((1U << OSD_DRAW_L_REG_DRAW_U_00_LEN) - 1) << OSD_DRAW_L_REG_DRAW_U_00_POS))
#define OSD_DRAW_L_REG_DRAW_Y_00                   OSD_DRAW_L_REG_DRAW_Y_00
#define OSD_DRAW_L_REG_DRAW_Y_00_POS               (24U)
#define OSD_DRAW_L_REG_DRAW_Y_00_LEN               (8U)
#define OSD_DRAW_L_REG_DRAW_Y_00_MSK               (((1U << OSD_DRAW_L_REG_DRAW_Y_00_LEN) - 1) << OSD_DRAW_L_REG_DRAW_Y_00_POS)
#define OSD_DRAW_L_REG_DRAW_Y_00_UMSK              (~(((1U << OSD_DRAW_L_REG_DRAW_Y_00_LEN) - 1) << OSD_DRAW_L_REG_DRAW_Y_00_POS))

/* 0x8 : draw_partial_x_config0 */
#define OSD_DRAW_L_DRAW_PARTIAL_X_CONFIG0_OFFSET (0x8)
#define OSD_DRAW_L_REG_DRAW_X_MIN_00             OSD_DRAW_L_REG_DRAW_X_MIN_00
#define OSD_DRAW_L_REG_DRAW_X_MIN_00_POS         (0U)
#define OSD_DRAW_L_REG_DRAW_X_MIN_00_LEN         (11U)
#define OSD_DRAW_L_REG_DRAW_X_MIN_00_MSK         (((1U << OSD_DRAW_L_REG_DRAW_X_MIN_00_LEN) - 1) << OSD_DRAW_L_REG_DRAW_X_MIN_00_POS)
#define OSD_DRAW_L_REG_DRAW_X_MIN_00_UMSK        (~(((1U << OSD_DRAW_L_REG_DRAW_X_MIN_00_LEN) - 1) << OSD_DRAW_L_REG_DRAW_X_MIN_00_POS))
#define OSD_DRAW_L_REG_DRAW_X_MAX_00             OSD_DRAW_L_REG_DRAW_X_MAX_00
#define OSD_DRAW_L_REG_DRAW_X_MAX_00_POS         (16U)
#define OSD_DRAW_L_REG_DRAW_X_MAX_00_LEN         (11U)
#define OSD_DRAW_L_REG_DRAW_X_MAX_00_MSK         (((1U << OSD_DRAW_L_REG_DRAW_X_MAX_00_LEN) - 1) << OSD_DRAW_L_REG_DRAW_X_MAX_00_POS)
#define OSD_DRAW_L_REG_DRAW_X_MAX_00_UMSK        (~(((1U << OSD_DRAW_L_REG_DRAW_X_MAX_00_LEN) - 1) << OSD_DRAW_L_REG_DRAW_X_MAX_00_POS))

/* 0xC : draw_partial_y_config0 */
#define OSD_DRAW_L_DRAW_PARTIAL_Y_CONFIG0_OFFSET (0xC)
#define OSD_DRAW_L_REG_DRAW_Y_MIN_00             OSD_DRAW_L_REG_DRAW_Y_MIN_00
#define OSD_DRAW_L_REG_DRAW_Y_MIN_00_POS         (0U)
#define OSD_DRAW_L_REG_DRAW_Y_MIN_00_LEN         (11U)
#define OSD_DRAW_L_REG_DRAW_Y_MIN_00_MSK         (((1U << OSD_DRAW_L_REG_DRAW_Y_MIN_00_LEN) - 1) << OSD_DRAW_L_REG_DRAW_Y_MIN_00_POS)
#define OSD_DRAW_L_REG_DRAW_Y_MIN_00_UMSK        (~(((1U << OSD_DRAW_L_REG_DRAW_Y_MIN_00_LEN) - 1) << OSD_DRAW_L_REG_DRAW_Y_MIN_00_POS))
#define OSD_DRAW_L_REG_DRAW_Y_MAX_00             OSD_DRAW_L_REG_DRAW_Y_MAX_00
#define OSD_DRAW_L_REG_DRAW_Y_MAX_00_POS         (16U)
#define OSD_DRAW_L_REG_DRAW_Y_MAX_00_LEN         (11U)
#define OSD_DRAW_L_REG_DRAW_Y_MAX_00_MSK         (((1U << OSD_DRAW_L_REG_DRAW_Y_MAX_00_LEN) - 1) << OSD_DRAW_L_REG_DRAW_Y_MAX_00_POS)
#define OSD_DRAW_L_REG_DRAW_Y_MAX_00_UMSK        (~(((1U << OSD_DRAW_L_REG_DRAW_Y_MAX_00_LEN) - 1) << OSD_DRAW_L_REG_DRAW_Y_MAX_00_POS))

/* 0x10 : draw_partial_yuv_config1 */
#define OSD_DRAW_L_DRAW_PARTIAL_YUV_CONFIG1_OFFSET (0x10)
#define OSD_DRAW_L_REG_DRAW_TH_01                  OSD_DRAW_L_REG_DRAW_TH_01
#define OSD_DRAW_L_REG_DRAW_TH_01_POS              (0U)
#define OSD_DRAW_L_REG_DRAW_TH_01_LEN              (8U)
#define OSD_DRAW_L_REG_DRAW_TH_01_MSK              (((1U << OSD_DRAW_L_REG_DRAW_TH_01_LEN) - 1) << OSD_DRAW_L_REG_DRAW_TH_01_POS)
#define OSD_DRAW_L_REG_DRAW_TH_01_UMSK             (~(((1U << OSD_DRAW_L_REG_DRAW_TH_01_LEN) - 1) << OSD_DRAW_L_REG_DRAW_TH_01_POS))
#define OSD_DRAW_L_REG_DRAW_V_01                   OSD_DRAW_L_REG_DRAW_V_01
#define OSD_DRAW_L_REG_DRAW_V_01_POS               (8U)
#define OSD_DRAW_L_REG_DRAW_V_01_LEN               (8U)
#define OSD_DRAW_L_REG_DRAW_V_01_MSK               (((1U << OSD_DRAW_L_REG_DRAW_V_01_LEN) - 1) << OSD_DRAW_L_REG_DRAW_V_01_POS)
#define OSD_DRAW_L_REG_DRAW_V_01_UMSK              (~(((1U << OSD_DRAW_L_REG_DRAW_V_01_LEN) - 1) << OSD_DRAW_L_REG_DRAW_V_01_POS))
#define OSD_DRAW_L_REG_DRAW_U_01                   OSD_DRAW_L_REG_DRAW_U_01
#define OSD_DRAW_L_REG_DRAW_U_01_POS               (16U)
#define OSD_DRAW_L_REG_DRAW_U_01_LEN               (8U)
#define OSD_DRAW_L_REG_DRAW_U_01_MSK               (((1U << OSD_DRAW_L_REG_DRAW_U_01_LEN) - 1) << OSD_DRAW_L_REG_DRAW_U_01_POS)
#define OSD_DRAW_L_REG_DRAW_U_01_UMSK              (~(((1U << OSD_DRAW_L_REG_DRAW_U_01_LEN) - 1) << OSD_DRAW_L_REG_DRAW_U_01_POS))
#define OSD_DRAW_L_REG_DRAW_Y_01                   OSD_DRAW_L_REG_DRAW_Y_01
#define OSD_DRAW_L_REG_DRAW_Y_01_POS               (24U)
#define OSD_DRAW_L_REG_DRAW_Y_01_LEN               (8U)
#define OSD_DRAW_L_REG_DRAW_Y_01_MSK               (((1U << OSD_DRAW_L_REG_DRAW_Y_01_LEN) - 1) << OSD_DRAW_L_REG_DRAW_Y_01_POS)
#define OSD_DRAW_L_REG_DRAW_Y_01_UMSK              (~(((1U << OSD_DRAW_L_REG_DRAW_Y_01_LEN) - 1) << OSD_DRAW_L_REG_DRAW_Y_01_POS))

