RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/osd_draw_l_reg.h
/* 0x4C : draw_partial_yuv_config6 */
#define OSD_DRAW_L_DRAW_PARTIAL_YUV_CONFIG6_OFFSET (0x4C)
#define OSD_DRAW_L_REG_DRAW_TH_06                  OSD_DRAW_L_REG_DRAW_TH_06
#define OSD_DRAW_L_REG_DRAW_TH_06_POS              (0U)
#define OSD_DRAW_L_REG_DRAW_TH_06_LEN              (8U)
#define OSD_DRAW_L_REG_DRAW_TH_06_MSK              (((1U << OSD_DRAW_L_REG_DRAW_TH_06_LEN) - 1) << OSD_DRAW_L_REG_DRAW_TH_06_POS)
#define OSD_DRAW_L_REG_DRAW_TH_06_UMSK             (~(((1U << OSD_DRAW_L_REG_DRAW_TH_06_LEN) - 1) << OSD_DRAW_L_REG_DRAW_TH_06_POS))
#define OSD_DRAW_L_REG_DRAW_V_06                   OSD_DRAW_L_REG_DRAW_V_06
#define OSD_DRAW_L_REG_DRAW_V_06_POS               (8U)
#define OSD_DRAW_L_REG_DRAW_V_06_LEN               (8U)
#define OSD_DRAW_L_REG_DRAW_V_06_MSK               (((1U << OSD_DRAW_L_REG_DRAW_V_06_LEN) - 1) << OSD_DRAW_L_REG_DRAW_V_06_POS)
#define OSD_DRAW_L_REG_DRAW_V_06_UMSK              (~(((1U << OSD_DRAW_L_REG_DRAW_V_06_LEN) - 1) << OSD_DRAW_L_REG_DRAW_V_06_POS))
#define OSD_DRAW_L_REG_DRAW_U_06                   OSD_DRAW_L_REG_DRAW_U_06
#define OSD_DRAW_L_REG_DRAW_U_06_POS               (16U)
#define OSD_DRAW_L_REG_DRAW_U_06_LEN               (8U)
#define OSD_DRAW_L_REG_DRAW_U_06_MSK               (((1U << OSD_DRAW_L_REG_DRAW_U_06_LEN) - 1) << OSD_DRAW_L_REG_DRAW_U_06_POS)
#define OSD_DRAW_L_REG_DRAW_U_06_UMSK              (~(((1U << OSD_DRAW_L_REG_DRAW_U_06_LEN) - 1) << OSD_DRAW_L_REG_DRAW_U_06_POS))
#define OSD_DRAW_L_REG_DRAW_Y_06                   OSD_DRAW_L_REG_DRAW_Y_06
#define OSD_DRAW_L_REG_DRAW_Y_06_POS               (24U)
#define OSD_DRAW_L_REG_DRAW_Y_06_LEN               (8U)
#define OSD_DRAW_L_REG_DRAW_Y_06_MSK               (((1U << OSD_DRAW_L_REG_DRAW_Y_06_LEN) - 1) << OSD_DRAW_L_REG_DRAW_Y_06_POS)
#define OSD_DRAW_L_REG_DRAW_Y_06_UMSK              (~(((1U << OSD_DRAW_L_REG_DRAW_Y_06_LEN) - 1) << OSD_DRAW_L_REG_DRAW_Y_06_POS))

/* 0x50 : draw_partial_x_config6 */
#define OSD_DRAW_L_DRAW_PARTIAL_X_CONFIG6_OFFSET (0x50)
#define OSD_DRAW_L_REG_DRAW_X_MIN_06             OSD_DRAW_L_REG_DRAW_X_MIN_06
#define OSD_DRAW_L_REG_DRAW_X_MIN_06_POS         (0U)
#define OSD_DRAW_L_REG_DRAW_X_MIN_06_LEN         (11U)
#define OSD_DRAW_L_REG_DRAW_X_MIN_06_MSK         (((1U << OSD_DRAW_L_REG_DRAW_X_MIN_06_LEN) - 1) << OSD_DRAW_L_REG_DRAW_X_MIN_06_POS)
#define OSD_DRAW_L_REG_DRAW_X_MIN_06_UMSK        (~(((1U << OSD_DRAW_L_REG_DRAW_X_MIN_06_LEN) - 1) << OSD_DRAW_L_REG_DRAW_X_MIN_06_POS))
#define OSD_DRAW_L_REG_DRAW_X_MAX_06             OSD_DRAW_L_REG_DRAW_X_MAX_06
#define OSD_DRAW_L_REG_DRAW_X_MAX_06_POS         (16U)
#define OSD_DRAW_L_REG_DRAW_X_MAX_06_LEN         (11U)
#define OSD_DRAW_L_REG_DRAW_X_MAX_06_MSK         (((1U << OSD_DRAW_L_REG_DRAW_X_MAX_06_LEN) - 1) << OSD_DRAW_L_REG_DRAW_X_MAX_06_POS)
#define OSD_DRAW_L_REG_DRAW_X_MAX_06_UMSK        (~(((1U << OSD_DRAW_L_REG_DRAW_X_MAX_06_LEN) - 1) << OSD_DRAW_L_REG_DRAW_X_MAX_06_POS))

/* 0x54 : draw_partial_y_config6 */
#define OSD_DRAW_L_DRAW_PARTIAL_Y_CONFIG6_OFFSET (0x54)
#define OSD_DRAW_L_REG_DRAW_Y_MIN_06             OSD_DRAW_L_REG_DRAW_Y_MIN_06
#define OSD_DRAW_L_REG_DRAW_Y_MIN_06_POS         (0U)
#define OSD_DRAW_L_REG_DRAW_Y_MIN_06_LEN         (11U)
#define OSD_DRAW_L_REG_DRAW_Y_MIN_06_MSK         (((1U << OSD_DRAW_L_REG_DRAW_Y_MIN_06_LEN) - 1) << OSD_DRAW_L_REG_DRAW_Y_MIN_06_POS)
#define OSD_DRAW_L_REG_DRAW_Y_MIN_06_UMSK        (~(((1U << OSD_DRAW_L_REG_DRAW_Y_MIN_06_LEN) - 1) << OSD_DRAW_L_REG_DRAW_Y_MIN_06_POS))
#define OSD_DRAW_L_REG_DRAW_Y_MAX_06             OSD_DRAW_L_REG_DRAW_Y_MAX_06
#define OSD_DRAW_L_REG_DRAW_Y_MAX_06_POS         (16U)
#define OSD_DRAW_L_REG_DRAW_Y_MAX_06_LEN         (11U)
#define OSD_DRAW_L_REG_DRAW_Y_MAX_06_MSK         (((1U << OSD_DRAW_L_REG_DRAW_Y_MAX_06_LEN) - 1) << OSD_DRAW_L_REG_DRAW_Y_MAX_06_POS)
#define OSD_DRAW_L_REG_DRAW_Y_MAX_06_UMSK        (~(((1U << OSD_DRAW_L_REG_DRAW_Y_MAX_06_LEN) - 1) << OSD_DRAW_L_REG_DRAW_Y_MAX_06_POS))

/* 0x58 : draw_partial_yuv_config7 */
#define OSD_DRAW_L_DRAW_PARTIAL_YUV_CONFIG7_OFFSET (0x58)
#define OSD_DRAW_L_REG_DRAW_TH_07                  OSD_DRAW_L_REG_DRAW_TH_07
#define OSD_DRAW_L_REG_DRAW_TH_07_POS              (0U)
#define OSD_DRAW_L_REG_DRAW_TH_07_LEN              (8U)
#define OSD_DRAW_L_REG_DRAW_TH_07_MSK              (((1U << OSD_DRAW_L_REG_DRAW_TH_07_LEN) - 1) << OSD_DRAW_L_REG_DRAW_TH_07_POS)
#define OSD_DRAW_L_REG_DRAW_TH_07_UMSK             (~(((1U << OSD_DRAW_L_REG_DRAW_TH_07_LEN) - 1) << OSD_DRAW_L_REG_DRAW_TH_07_POS))
#define OSD_DRAW_L_REG_DRAW_V_07                   OSD_DRAW_L_REG_DRAW_V_07
#define OSD_DRAW_L_REG_DRAW_V_07_POS               (8U)
#define OSD_DRAW_L_REG_DRAW_V_07_LEN               (8U)
#define OSD_DRAW_L_REG_DRAW_V_07_MSK               (((1U << OSD_DRAW_L_REG_DRAW_V_07_LEN) - 1) << OSD_DRAW_L_REG_DRAW_V_07_POS)
#define OSD_DRAW_L_REG_DRAW_V_07_UMSK              (~(((1U << OSD_DRAW_L_REG_DRAW_V_07_LEN) - 1) << OSD_DRAW_L_REG_DRAW_V_07_POS))
#define OSD_DRAW_L_REG_DRAW_U_07                   OSD_DRAW_L_REG_DRAW_U_07
#define OSD_DRAW_L_REG_DRAW_U_07_POS               (16U)
#define OSD_DRAW_L_REG_DRAW_U_07_LEN               (8U)
#define OSD_DRAW_L_REG_DRAW_U_07_MSK               (((1U << OSD_DRAW_L_REG_DRAW_U_07_LEN) - 1) << OSD_DRAW_L_REG_DRAW_U_07_POS)
#define OSD_DRAW_L_REG_DRAW_U_07_UMSK              (~(((1U << OSD_DRAW_L_REG_DRAW_U_07_LEN) - 1) << OSD_DRAW_L_REG_DRAW_U_07_POS))
#define OSD_DRAW_L_REG_DRAW_Y_07                   OSD_DRAW_L_REG_DRAW_Y_07
#define OSD_DRAW_L_REG_DRAW_Y_07_POS               (24U)
#define OSD_DRAW_L_REG_DRAW_Y_07_LEN               (8U)
#define OSD_DRAW_L_REG_DRAW_Y_07_MSK               (((1U << OSD_DRAW_L_REG_DRAW_Y_07_LEN) - 1) << OSD_DRAW_L_REG_DRAW_Y_07_POS)
#define OSD_DRAW_L_REG_DRAW_Y_07_UMSK              (~(((1U << OSD_DRAW_L_REG_DRAW_Y_07_LEN) - 1) << OSD_DRAW_L_REG_DRAW_Y_07_POS))

/* 0x5C : draw_partial_x_config7 */
#define OSD_DRAW_L_DRAW_PARTIAL_X_CONFIG7_OFFSET (0x5C)
#define OSD_DRAW_L_REG_DRAW_X_MIN_07             OSD_DRAW_L_REG_DRAW_X_MIN_07
#define OSD_DRAW_L_REG_DRAW_X_MIN_07_POS         (0U)
#define OSD_DRAW_L_REG_DRAW_X_MIN_07_LEN         (11U)
#define OSD_DRAW_L_REG_DRAW_X_MIN_07_MSK         (((1U << OSD_DRAW_L_REG_DRAW_X_MIN_07_LEN) - 1) << OSD_DRAW_L_REG_DRAW_X_MIN_07_POS)
#define OSD_DRAW_L_REG_DRAW_X_MIN_07_UMSK        (~(((1U << OSD_DRAW_L_REG_DRAW_X_MIN_07_LEN) - 1) << OSD_DRAW_L_REG_DRAW_X_MIN_07_POS))
#define OSD_DRAW_L_REG_DRAW_X_MAX_07             OSD_DRAW_L_REG_DRAW_X_MAX_07
#define OSD_DRAW_L_REG_DRAW_X_MAX_07_POS         (16U)
#define OSD_DRAW_L_REG_DRAW_X_MAX_07_LEN         (11U)
#define OSD_DRAW_L_REG_DRAW_X_MAX_07_MSK         (((1U << OSD_DRAW_L_REG_DRAW_X_MAX_07_LEN) - 1) << OSD_DRAW_L_REG_DRAW_X_MAX_07_POS)
#define OSD_DRAW_L_REG_DRAW_X_MAX_07_UMSK        (~(((1U << OSD_DRAW_L_REG_DRAW_X_MAX_07_LEN) - 1) << OSD_DRAW_L_REG_DRAW_X_MAX_07_POS))

/* 0x60 : draw_partial_y_config7 */
#define OSD_DRAW_L_DRAW_PARTIAL_Y_CONFIG7_OFFSET (0x60)
#define OSD_DRAW_L_REG_DRAW_Y_MIN_07             OSD_DRAW_L_REG_DRAW_Y_MIN_07
#define OSD_DRAW_L_REG_DRAW_Y_MIN_07_POS         (0U)
#define OSD_DRAW_L_REG_DRAW_Y_MIN_07_LEN         (11U)
#define OSD_DRAW_L_REG_DRAW_Y_MIN_07_MSK         (((1U << OSD_DRAW_L_REG_DRAW_Y_MIN_07_LEN) - 1) << OSD_DRAW_L_REG_DRAW_Y_MIN_07_POS)
#define OSD_DRAW_L_REG_DRAW_Y_MIN_07_UMSK        (~(((1U << OSD_DRAW_L_REG_DRAW_Y_MIN_07_LEN) - 1) << OSD_DRAW_L_REG_DRAW_Y_MIN_07_POS))
#define OSD_DRAW_L_REG_DRAW_Y_MAX_07             OSD_DRAW_L_REG_DRAW_Y_MAX_07
#define OSD_DRAW_L_REG_DRAW_Y_MAX_07_POS         (16U)
#define OSD_DRAW_L_REG_DRAW_Y_MAX_07_LEN         (11U)
#define OSD_DRAW_L_REG_DRAW_Y_MAX_07_MSK         (((1U << OSD_DRAW_L_REG_DRAW_Y_MAX_07_LEN) - 1) << OSD_DRAW_L_REG_DRAW_Y_MAX_07_POS)
#define OSD_DRAW_L_REG_DRAW_Y_MAX_07_UMSK        (~(((1U << OSD_DRAW_L_REG_DRAW_Y_MAX_07_LEN) - 1) << OSD_DRAW_L_REG_DRAW_Y_MAX_07_POS))

/* 0x64 : draw_partial_yuv_config8 */
#define OSD_DRAW_L_DRAW_PARTIAL_YUV_CONFIG8_OFFSET (0x64)
#define OSD_DRAW_L_REG_DRAW_TH_08                  OSD_DRAW_L_REG_DRAW_TH_08
#define OSD_DRAW_L_REG_DRAW_TH_08_POS              (0U)
#define OSD_DRAW_L_REG_DRAW_TH_08_LEN              (8U)
#define OSD_DRAW_L_REG_DRAW_TH_08_MSK              (((1U << OSD_DRAW_L_REG_DRAW_TH_08_LEN) - 1) << OSD_DRAW_L_REG_DRAW_TH_08_POS)
#define OSD_DRAW_L_REG_DRAW_TH_08_UMSK             (~(((1U << OSD_DRAW_L_REG_DRAW_TH_08_LEN) - 1) << OSD_DRAW_L_REG_DRAW_TH_08_POS))
#define OSD_DRAW_L_REG_DRAW_V_08                   OSD_DRAW_L_REG_DRAW_V_08
#define OSD_DRAW_L_REG_DRAW_V_08_POS               (8U)
#define OSD_DRAW_L_REG_DRAW_V_08_LEN               (8U)
#define OSD_DRAW_L_REG_DRAW_V_08_MSK               (((1U << OSD_DRAW_L_REG_DRAW_V_08_LEN) - 1) << OSD_DRAW_L_REG_DRAW_V_08_POS)
#define OSD_DRAW_L_REG_DRAW_V_08_UMSK              (~(((1U << OSD_DRAW_L_REG_DRAW_V_08_LEN) - 1) << OSD_DRAW_L_REG_DRAW_V_08_POS))
#define OSD_DRAW_L_REG_DRAW_U_08                   OSD_DRAW_L_REG_DRAW_U_08
#define OSD_DRAW_L_REG_DRAW_U_08_POS               (16U)
#define OSD_DRAW_L_REG_DRAW_U_08_LEN               (8U)
#define OSD_DRAW_L_REG_DRAW_U_08_MSK               (((1U << OSD_DRAW_L_REG_DRAW_U_08_LEN) - 1) << OSD_DRAW_L_REG_DRAW_U_08_POS)
#define OSD_DRAW_L_REG_DRAW_U_08_UMSK              (~(((1U << OSD_DRAW_L_REG_DRAW_U_08_LEN) - 1) << OSD_DRAW_L_REG_DRAW_U_08_POS))
#define OSD_DRAW_L_REG_DRAW_Y_08                   OSD_DRAW_L_REG_DRAW_Y_08
#define OSD_DRAW_L_REG_DRAW_Y_08_POS               (24U)
#define OSD_DRAW_L_REG_DRAW_Y_08_LEN               (8U)
#define OSD_DRAW_L_REG_DRAW_Y_08_MSK               (((1U << OSD_DRAW_L_REG_DRAW_Y_08_LEN) - 1) << OSD_DRAW_L_REG_DRAW_Y_08_POS)
#define OSD_DRAW_L_REG_DRAW_Y_08_UMSK              (~(((1U << OSD_DRAW_L_REG_DRAW_Y_08_LEN) - 1) << OSD_DRAW_L_REG_DRAW_Y_08_POS))

/* 0x68 : draw_partial_x_config8 */
#define OSD_DRAW_L_DRAW_PARTIAL_X_CONFIG8_OFFSET (0x68)
#define OSD_DRAW_L_REG_DRAW_X_MIN_08             OSD_DRAW_L_REG_DRAW_X_MIN_08
#define OSD_DRAW_L_REG_DRAW_X_MIN_08_POS         (0U)
#define OSD_DRAW_L_REG_DRAW_X_MIN_08_LEN         (11U)
#define OSD_DRAW_L_REG_DRAW_X_MIN_08_MSK         (((1U << OSD_DRAW_L_REG_DRAW_X_MIN_08_LEN) - 1) << OSD_DRAW_L_REG_DRAW_X_MIN_08_POS)
#define OSD_DRAW_L_REG_DRAW_X_MIN_08_UMSK        (~(((1U << OSD_DRAW_L_REG_DRAW_X_MIN_08_LEN) - 1) << OSD_DRAW_L_REG_DRAW_X_MIN_08_POS))
#define OSD_DRAW_L_REG_DRAW_X_MAX_08             OSD_DRAW_L_REG_DRAW_X_MAX_08
#define OSD_DRAW_L_REG_DRAW_X_MAX_08_POS         (16U)
#define OSD_DRAW_L_REG_DRAW_X_MAX_08_LEN         (11U)
#define OSD_DRAW_L_REG_DRAW_X_MAX_08_MSK         (((1U << OSD_DRAW_L_REG_DRAW_X_MAX_08_LEN) - 1) << OSD_DRAW_L_REG_DRAW_X_MAX_08_POS)
#define OSD_DRAW_L_REG_DRAW_X_MAX_08_UMSK        (~(((1U << OSD_DRAW_L_REG_DRAW_X_MAX_08_LEN) - 1) << OSD_DRAW_L_REG_DRAW_X_MAX_08_POS))

/* 0x6C : draw_partial_y_config8 */
#define OSD_DRAW_L_DRAW_PARTIAL_Y_CONFIG8_OFFSET (0x6C)
#define OSD_DRAW_L_REG_DRAW_Y_MIN_08             OSD_DRAW_L_REG_DRAW_Y_MIN_08
#define OSD_DRAW_L_REG_DRAW_Y_MIN_08_POS         (0U)
#define OSD_DRAW_L_REG_DRAW_Y_MIN_08_LEN         (11U)
#define OSD_DRAW_L_REG_DRAW_Y_MIN_08_MSK         (((1U << OSD_DRAW_L_REG_DRAW_Y_MIN_08_LEN) - 1) << OSD_DRAW_L_REG_DRAW_Y_MIN_08_POS)
#define OSD_DRAW_L_REG_DRAW_Y_MIN_08_UMSK        (~(((1U << OSD_DRAW_L_REG_DRAW_Y_MIN_08_LEN) - 1) << OSD_DRAW_L_REG_DRAW_Y_MIN_08_POS))
#define OSD_DRAW_L_REG_DRAW_Y_MAX_08             OSD_DRAW_L_REG_DRAW_Y_MAX_08
#define OSD_DRAW_L_REG_DRAW_Y_MAX_08_POS         (16U)
#define OSD_DRAW_L_REG_DRAW_Y_MAX_08_LEN         (11U)
#define OSD_DRAW_L_REG_DRAW_Y_MAX_08_MSK         (((1U << OSD_DRAW_L_REG_DRAW_Y_MAX_08_LEN) - 1) << OSD_DRAW_L_REG_DRAW_Y_MAX_08_POS)
#define OSD_DRAW_L_REG_DRAW_Y_MAX_08_UMSK        (~(((1U << OSD_DRAW_L_REG_DRAW_Y_MAX_08_LEN) - 1) << OSD_DRAW_L_REG_DRAW_Y_MAX_08_POS))

/* 0x70 : draw_partial_yuv_config9 */
#define OSD_DRAW_L_DRAW_PARTIAL_YUV_CONFIG9_OFFSET (0x70)
#define OSD_DRAW_L_REG_DRAW_TH_09                  OSD_DRAW_L_REG_DRAW_TH_09
#define OSD_DRAW_L_REG_DRAW_TH_09_POS              (0U)
#define OSD_DRAW_L_REG_DRAW_TH_09_LEN              (8U)
#define OSD_DRAW_L_REG_DRAW_TH_09_MSK              (((1U << OSD_DRAW_L_REG_DRAW_TH_09_LEN) - 1) << OSD_DRAW_L_REG_DRAW_TH_09_POS)
#define OSD_DRAW_L_REG_DRAW_TH_09_UMSK             (~(((1U << OSD_DRAW_L_REG_DRAW_TH_09_LEN) - 1) << OSD_DRAW_L_REG_DRAW_TH_09_POS))
#define OSD_DRAW_L_REG_DRAW_V_09                   OSD_DRAW_L_REG_DRAW_V_09
#define OSD_DRAW_L_REG_DRAW_V_09_POS               (8U)
#define OSD_DRAW_L_REG_DRAW_V_09_LEN               (8U)
#define OSD_DRAW_L_REG_DRAW_V_09_MSK               (((1U << OSD_DRAW_L_REG_DRAW_V_09_LEN) - 1) << OSD_DRAW_L_REG_DRAW_V_09_POS)
#define OSD_DRAW_L_REG_DRAW_V_09_UMSK              (~(((1U << OSD_DRAW_L_REG_DRAW_V_09_LEN) - 1) << OSD_DRAW_L_REG_DRAW_V_09_POS))
#define OSD_DRAW_L_REG_DRAW_U_09                   OSD_DRAW_L_REG_DRAW_U_09
#define OSD_DRAW_L_REG_DRAW_U_09_POS               (16U)
#define OSD_DRAW_L_REG_DRAW_U_09_LEN               (8U)
#define OSD_DRAW_L_REG_DRAW_U_09_MSK               (((1U << OSD_DRAW_L_REG_DRAW_U_09_LEN) - 1) << OSD_DRAW_L_REG_DRAW_U_09_POS)
#define OSD_DRAW_L_REG_DRAW_U_09_UMSK              (~(((1U << OSD_DRAW_L_REG_DRAW_U_09_LEN) - 1) << OSD_DRAW_L_REG_DRAW_U_09_POS))
#define OSD_DRAW_L_REG_DRAW_Y_09                   OSD_DRAW_L_REG_DRAW_Y_09
#define OSD_DRAW_L_REG_DRAW_Y_09_POS               (24U)
#define OSD_DRAW_L_REG_DRAW_Y_09_LEN               (8U)
#define OSD_DRAW_L_REG_DRAW_Y_09_MSK               (((1U << OSD_DRAW_L_REG_DRAW_Y_09_LEN) - 1) << OSD_DRAW_L_REG_DRAW_Y_09_POS)
#define OSD_DRAW_L_REG_DRAW_Y_09_UMSK              (~(((1U << OSD_DRAW_L_REG_DRAW_Y_09_LEN) - 1) << OSD_DRAW_L_REG_DRAW_Y_09_POS))

/* 0x74 : draw_partial_x_config9 */
#define OSD_DRAW_L_DRAW_PARTIAL_X_CONFIG9_OFFSET (0x74)
#define OSD_DRAW_L_REG_DRAW_X_MIN_09             OSD_DRAW_L_REG_DRAW_X_MIN_09
#define OSD_DRAW_L_REG_DRAW_X_MIN_09_POS         (0U)
#define OSD_DRAW_L_REG_DRAW_X_MIN_09_LEN         (11U)
#define OSD_DRAW_L_REG_DRAW_X_MIN_09_MSK         (((1U << OSD_DRAW_L_REG_DRAW_X_MIN_09_LEN) - 1) << OSD_DRAW_L_REG_DRAW_X_MIN_09_POS)
#define OSD_DRAW_L_REG_DRAW_X_MIN_09_UMSK        (~(((1U << OSD_DRAW_L_REG_DRAW_X_MIN_09_LEN) - 1) << OSD_DRAW_L_REG_DRAW_X_MIN_09_POS))
#define OSD_DRAW_L_REG_DRAW_X_MAX_09             OSD_DRAW_L_REG_DRAW_X_MAX_09
#define OSD_DRAW_L_REG_DRAW_X_MAX_09_POS         (16U)
#define OSD_DRAW_L_REG_DRAW_X_MAX_09_LEN         (11U)
#define OSD_DRAW_L_REG_DRAW_X_MAX_09_MSK         (((1U << OSD_DRAW_L_REG_DRAW_X_MAX_09_LEN) - 1) << OSD_DRAW_L_REG_DRAW_X_MAX_09_POS)
#define OSD_DRAW_L_REG_DRAW_X_MAX_09_UMSK        (~(((1U << OSD_DRAW_L_REG_DRAW_X_MAX_09_LEN) - 1) << OSD_DRAW_L_REG_DRAW_X_MAX_09_POS))

/* 0x78 : draw_partial_y_config9 */
#define OSD_DRAW_L_DRAW_PARTIAL_Y_CONFIG9_OFFSET (0x78)
#define OSD_DRAW_L_REG_DRAW_Y_MIN_09             OSD_DRAW_L_REG_DRAW_Y_MIN_09
#define OSD_DRAW_L_REG_DRAW_Y_MIN_09_POS         (0U)
#define OSD_DRAW_L_REG_DRAW_Y_MIN_09_LEN         (11U)
#define OSD_DRAW_L_REG_DRAW_Y_MIN_09_MSK         (((1U << OSD_DRAW_L_REG_DRAW_Y_MIN_09_LEN) - 1) << OSD_DRAW_L_REG_DRAW_Y_MIN_09_POS)
#define OSD_DRAW_L_REG_DRAW_Y_MIN_09_UMSK        (~(((1U << OSD_DRAW_L_REG_DRAW_Y_MIN_09_LEN) - 1) << OSD_DRAW_L_REG_DRAW_Y_MIN_09_POS))
#define OSD_DRAW_L_REG_DRAW_Y_MAX_09             OSD_DRAW_L_REG_DRAW_Y_MAX_09
#define OSD_DRAW_L_REG_DRAW_Y_MAX_09_POS         (16U)
#define OSD_DRAW_L_REG_DRAW_Y_MAX_09_LEN         (11U)
#define OSD_DRAW_L_REG_DRAW_Y_MAX_09_MSK         (((1U << OSD_DRAW_L_REG_DRAW_Y_MAX_09_LEN) - 1) << OSD_DRAW_L_REG_DRAW_Y_MAX_09_POS)
#define OSD_DRAW_L_REG_DRAW_Y_MAX_09_UMSK        (~(((1U << OSD_DRAW_L_REG_DRAW_Y_MAX_09_LEN) - 1) << OSD_DRAW_L_REG_DRAW_Y_MAX_09_POS))

