RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/osd_draw_l_reg.h
/* 0x7C : draw_partial_yuv_configa */
#define OSD_DRAW_L_DRAW_PARTIAL_YUV_CONFIGA_OFFSET (0x7C)
#define OSD_DRAW_L_REG_DRAW_TH_0A                  OSD_DRAW_L_REG_DRAW_TH_0A
#define OSD_DRAW_L_REG_DRAW_TH_0A_POS              (0U)
#define OSD_DRAW_L_REG_DRAW_TH_0A_LEN              (8U)
#define OSD_DRAW_L_REG_DRAW_TH_0A_MSK              (((1U << OSD_DRAW_L_REG_DRAW_TH_0A_LEN) - 1) << OSD_DRAW_L_REG_DRAW_TH_0A_POS)
#define OSD_DRAW_L_REG_DRAW_TH_0A_UMSK             (~(((1U << OSD_DRAW_L_REG_DRAW_TH_0A_LEN) - 1) << OSD_DRAW_L_REG_DRAW_TH_0A_POS))
#define OSD_DRAW_L_REG_DRAW_V_0A                   OSD_DRAW_L_REG_DRAW_V_0A
#define OSD_DRAW_L_REG_DRAW_V_0A_POS               (8U)
#define OSD_DRAW_L_REG_DRAW_V_0A_LEN               (8U)
#define OSD_DRAW_L_REG_DRAW_V_0A_MSK               (((1U << OSD_DRAW_L_REG_DRAW_V_0A_LEN) - 1) << OSD_DRAW_L_REG_DRAW_V_0A_POS)
#define OSD_DRAW_L_REG_DRAW_V_0A_UMSK              (~(((1U << OSD_DRAW_L_REG_DRAW_V_0A_LEN) - 1) << OSD_DRAW_L_REG_DRAW_V_0A_POS))
#define OSD_DRAW_L_REG_DRAW_U_0A                   OSD_DRAW_L_REG_DRAW_U_0A
#define OSD_DRAW_L_REG_DRAW_U_0A_POS               (16U)
#define OSD_DRAW_L_REG_DRAW_U_0A_LEN               (8U)
#define OSD_DRAW_L_REG_DRAW_U_0A_MSK               (((1U << OSD_DRAW_L_REG_DRAW_U_0A_LEN) - 1) << OSD_DRAW_L_REG_DRAW_U_0A_POS)
#define OSD_DRAW_L_REG_DRAW_U_0A_UMSK              (~(((1U << OSD_DRAW_L_REG_DRAW_U_0A_LEN) - 1) << OSD_DRAW_L_REG_DRAW_U_0A_POS))
#define OSD_DRAW_L_REG_DRAW_Y_0A                   OSD_DRAW_L_REG_DRAW_Y_0A
#define OSD_DRAW_L_REG_DRAW_Y_0A_POS               (24U)
#define OSD_DRAW_L_REG_DRAW_Y_0A_LEN               (8U)
#define OSD_DRAW_L_REG_DRAW_Y_0A_MSK               (((1U << OSD_DRAW_L_REG_DRAW_Y_0A_LEN) - 1) << OSD_DRAW_L_REG_DRAW_Y_0A_POS)
#define OSD_DRAW_L_REG_DRAW_Y_0A_UMSK              (~(((1U << OSD_DRAW_L_REG_DRAW_Y_0A_LEN) - 1) << OSD_DRAW_L_REG_DRAW_Y_0A_POS))

/* 0x80 : draw_partial_x_configa */
#define OSD_DRAW_L_DRAW_PARTIAL_X_CONFIGA_OFFSET (0x80)
#define OSD_DRAW_L_REG_DRAW_X_MIN_0A             OSD_DRAW_L_REG_DRAW_X_MIN_0A
#define OSD_DRAW_L_REG_DRAW_X_MIN_0A_POS         (0U)
#define OSD_DRAW_L_REG_DRAW_X_MIN_0A_LEN         (11U)
#define OSD_DRAW_L_REG_DRAW_X_MIN_0A_MSK         (((1U << OSD_DRAW_L_REG_DRAW_X_MIN_0A_LEN) - 1) << OSD_DRAW_L_REG_DRAW_X_MIN_0A_POS)
#define OSD_DRAW_L_REG_DRAW_X_MIN_0A_UMSK        (~(((1U << OSD_DRAW_L_REG_DRAW_X_MIN_0A_LEN) - 1) << OSD_DRAW_L_REG_DRAW_X_MIN_0A_POS))
#define OSD_DRAW_L_REG_DRAW_X_MAX_0A             OSD_DRAW_L_REG_DRAW_X_MAX_0A
#define OSD_DRAW_L_REG_DRAW_X_MAX_0A_POS         (16U)
#define OSD_DRAW_L_REG_DRAW_X_MAX_0A_LEN         (11U)
#define OSD_DRAW_L_REG_DRAW_X_MAX_0A_MSK         (((1U << OSD_DRAW_L_REG_DRAW_X_MAX_0A_LEN) - 1) << OSD_DRAW_L_REG_DRAW_X_MAX_0A_POS)
#define OSD_DRAW_L_REG_DRAW_X_MAX_0A_UMSK        (~(((1U << OSD_DRAW_L_REG_DRAW_X_MAX_0A_LEN) - 1) << OSD_DRAW_L_REG_DRAW_X_MAX_0A_POS))

/* 0x84 : draw_partial_y_configa */
#define OSD_DRAW_L_DRAW_PARTIAL_Y_CONFIGA_OFFSET (0x84)
#define OSD_DRAW_L_REG_DRAW_Y_MIN_0A             OSD_DRAW_L_REG_DRAW_Y_MIN_0A
#define OSD_DRAW_L_REG_DRAW_Y_MIN_0A_POS         (0U)
#define OSD_DRAW_L_REG_DRAW_Y_MIN_0A_LEN         (11U)
#define OSD_DRAW_L_REG_DRAW_Y_MIN_0A_MSK         (((1U << OSD_DRAW_L_REG_DRAW_Y_MIN_0A_LEN) - 1) << OSD_DRAW_L_REG_DRAW_Y_MIN_0A_POS)
#define OSD_DRAW_L_REG_DRAW_Y_MIN_0A_UMSK        (~(((1U << OSD_DRAW_L_REG_DRAW_Y_MIN_0A_LEN) - 1) << OSD_DRAW_L_REG_DRAW_Y_MIN_0A_POS))
#define OSD_DRAW_L_REG_DRAW_Y_MAX_0A             OSD_DRAW_L_REG_DRAW_Y_MAX_0A
#define OSD_DRAW_L_REG_DRAW_Y_MAX_0A_POS         (16U)
#define OSD_DRAW_L_REG_DRAW_Y_MAX_0A_LEN         (11U)
#define OSD_DRAW_L_REG_DRAW_Y_MAX_0A_MSK         (((1U << OSD_DRAW_L_REG_DRAW_Y_MAX_0A_LEN) - 1) << OSD_DRAW_L_REG_DRAW_Y_MAX_0A_POS)
#define OSD_DRAW_L_REG_DRAW_Y_MAX_0A_UMSK        (~(((1U << OSD_DRAW_L_REG_DRAW_Y_MAX_0A_LEN) - 1) << OSD_DRAW_L_REG_DRAW_Y_MAX_0A_POS))

/* 0x88 : draw_partial_yuv_configb */
#define OSD_DRAW_L_DRAW_PARTIAL_YUV_CONFIGB_OFFSET (0x88)
#define OSD_DRAW_L_REG_DRAW_TH_0B                  OSD_DRAW_L_REG_DRAW_TH_0B
#define OSD_DRAW_L_REG_DRAW_TH_0B_POS              (0U)
#define OSD_DRAW_L_REG_DRAW_TH_0B_LEN              (8U)
#define OSD_DRAW_L_REG_DRAW_TH_0B_MSK              (((1U << OSD_DRAW_L_REG_DRAW_TH_0B_LEN) - 1) << OSD_DRAW_L_REG_DRAW_TH_0B_POS)
#define OSD_DRAW_L_REG_DRAW_TH_0B_UMSK             (~(((1U << OSD_DRAW_L_REG_DRAW_TH_0B_LEN) - 1) << OSD_DRAW_L_REG_DRAW_TH_0B_POS))
#define OSD_DRAW_L_REG_DRAW_V_0B                   OSD_DRAW_L_REG_DRAW_V_0B
#define OSD_DRAW_L_REG_DRAW_V_0B_POS               (8U)
#define OSD_DRAW_L_REG_DRAW_V_0B_LEN               (8U)
#define OSD_DRAW_L_REG_DRAW_V_0B_MSK               (((1U << OSD_DRAW_L_REG_DRAW_V_0B_LEN) - 1) << OSD_DRAW_L_REG_DRAW_V_0B_POS)
#define OSD_DRAW_L_REG_DRAW_V_0B_UMSK              (~(((1U << OSD_DRAW_L_REG_DRAW_V_0B_LEN) - 1) << OSD_DRAW_L_REG_DRAW_V_0B_POS))
#define OSD_DRAW_L_REG_DRAW_U_0B                   OSD_DRAW_L_REG_DRAW_U_0B
#define OSD_DRAW_L_REG_DRAW_U_0B_POS               (16U)
#define OSD_DRAW_L_REG_DRAW_U_0B_LEN               (8U)
#define OSD_DRAW_L_REG_DRAW_U_0B_MSK               (((1U << OSD_DRAW_L_REG_DRAW_U_0B_LEN) - 1) << OSD_DRAW_L_REG_DRAW_U_0B_POS)
#define OSD_DRAW_L_REG_DRAW_U_0B_UMSK              (~(((1U << OSD_DRAW_L_REG_DRAW_U_0B_LEN) - 1) << OSD_DRAW_L_REG_DRAW_U_0B_POS))
#define OSD_DRAW_L_REG_DRAW_Y_0B                   OSD_DRAW_L_REG_DRAW_Y_0B
#define OSD_DRAW_L_REG_DRAW_Y_0B_POS               (24U)
#define OSD_DRAW_L_REG_DRAW_Y_0B_LEN               (8U)
#define OSD_DRAW_L_REG_DRAW_Y_0B_MSK               (((1U << OSD_DRAW_L_REG_DRAW_Y_0B_LEN) - 1) << OSD_DRAW_L_REG_DRAW_Y_0B_POS)
#define OSD_DRAW_L_REG_DRAW_Y_0B_UMSK              (~(((1U << OSD_DRAW_L_REG_DRAW_Y_0B_LEN) - 1) << OSD_DRAW_L_REG_DRAW_Y_0B_POS))

/* 0x8C : draw_partial_x_configb */
#define OSD_DRAW_L_DRAW_PARTIAL_X_CONFIGB_OFFSET (0x8C)
#define OSD_DRAW_L_REG_DRAW_X_MIN_0B             OSD_DRAW_L_REG_DRAW_X_MIN_0B
#define OSD_DRAW_L_REG_DRAW_X_MIN_0B_POS         (0U)
#define OSD_DRAW_L_REG_DRAW_X_MIN_0B_LEN         (11U)
#define OSD_DRAW_L_REG_DRAW_X_MIN_0B_MSK         (((1U << OSD_DRAW_L_REG_DRAW_X_MIN_0B_LEN) - 1) << OSD_DRAW_L_REG_DRAW_X_MIN_0B_POS)
#define OSD_DRAW_L_REG_DRAW_X_MIN_0B_UMSK        (~(((1U << OSD_DRAW_L_REG_DRAW_X_MIN_0B_LEN) - 1) << OSD_DRAW_L_REG_DRAW_X_MIN_0B_POS))
#define OSD_DRAW_L_REG_DRAW_X_MAX_0B             OSD_DRAW_L_REG_DRAW_X_MAX_0B
#define OSD_DRAW_L_REG_DRAW_X_MAX_0B_POS         (16U)
#define OSD_DRAW_L_REG_DRAW_X_MAX_0B_LEN         (11U)
#define OSD_DRAW_L_REG_DRAW_X_MAX_0B_MSK         (((1U << OSD_DRAW_L_REG_DRAW_X_MAX_0B_LEN) - 1) << OSD_DRAW_L_REG_DRAW_X_MAX_0B_POS)
#define OSD_DRAW_L_REG_DRAW_X_MAX_0B_UMSK        (~(((1U << OSD_DRAW_L_REG_DRAW_X_MAX_0B_LEN) - 1) << OSD_DRAW_L_REG_DRAW_X_MAX_0B_POS))

/* 0x90 : draw_partial_y_configb */
#define OSD_DRAW_L_DRAW_PARTIAL_Y_CONFIGB_OFFSET (0x90)
#define OSD_DRAW_L_REG_DRAW_Y_MIN_0B             OSD_DRAW_L_REG_DRAW_Y_MIN_0B
#define OSD_DRAW_L_REG_DRAW_Y_MIN_0B_POS         (0U)
#define OSD_DRAW_L_REG_DRAW_Y_MIN_0B_LEN         (11U)
#define OSD_DRAW_L_REG_DRAW_Y_MIN_0B_MSK         (((1U << OSD_DRAW_L_REG_DRAW_Y_MIN_0B_LEN) - 1) << OSD_DRAW_L_REG_DRAW_Y_MIN_0B_POS)
#define OSD_DRAW_L_REG_DRAW_Y_MIN_0B_UMSK        (~(((1U << OSD_DRAW_L_REG_DRAW_Y_MIN_0B_LEN) - 1) << OSD_DRAW_L_REG_DRAW_Y_MIN_0B_POS))
#define OSD_DRAW_L_REG_DRAW_Y_MAX_0B             OSD_DRAW_L_REG_DRAW_Y_MAX_0B
#define OSD_DRAW_L_REG_DRAW_Y_MAX_0B_POS         (16U)
#define OSD_DRAW_L_REG_DRAW_Y_MAX_0B_LEN         (11U)
#define OSD_DRAW_L_REG_DRAW_Y_MAX_0B_MSK         (((1U << OSD_DRAW_L_REG_DRAW_Y_MAX_0B_LEN) - 1) << OSD_DRAW_L_REG_DRAW_Y_MAX_0B_POS)
#define OSD_DRAW_L_REG_DRAW_Y_MAX_0B_UMSK        (~(((1U << OSD_DRAW_L_REG_DRAW_Y_MAX_0B_LEN) - 1) << OSD_DRAW_L_REG_DRAW_Y_MAX_0B_POS))

