RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/osd_draw_l_reg.h
/* 0x94 : draw_partial_yuv_configc */
#define OSD_DRAW_L_DRAW_PARTIAL_YUV_CONFIGC_OFFSET (0x94)
#define OSD_DRAW_L_REG_DRAW_TH_0C                  OSD_DRAW_L_REG_DRAW_TH_0C
#define OSD_DRAW_L_REG_DRAW_TH_0C_POS              (0U)
#define OSD_DRAW_L_REG_DRAW_TH_0C_LEN              (8U)
#define OSD_DRAW_L_REG_DRAW_TH_0C_MSK              (((1U << OSD_DRAW_L_REG_DRAW_TH_0C_LEN) - 1) << OSD_DRAW_L_REG_DRAW_TH_0C_POS)
#define OSD_DRAW_L_REG_DRAW_TH_0C_UMSK             (~(((1U << OSD_DRAW_L_REG_DRAW_TH_0C_LEN) - 1) << OSD_DRAW_L_REG_DRAW_TH_0C_POS))
#define OSD_DRAW_L_REG_DRAW_V_0C                   OSD_DRAW_L_REG_DRAW_V_0C
#define OSD_DRAW_L_REG_DRAW_V_0C_POS               (8U)
#define OSD_DRAW_L_REG_DRAW_V_0C_LEN               (8U)
#define OSD_DRAW_L_REG_DRAW_V_0C_MSK               (((1U << OSD_DRAW_L_REG_DRAW_V_0C_LEN) - 1) << OSD_DRAW_L_REG_DRAW_V_0C_POS)
#define OSD_DRAW_L_REG_DRAW_V_0C_UMSK              (~(((1U << OSD_DRAW_L_REG_DRAW_V_0C_LEN) - 1) << OSD_DRAW_L_REG_DRAW_V_0C_POS))
#define OSD_DRAW_L_REG_DRAW_U_0C                   OSD_DRAW_L_REG_DRAW_U_0C
#define OSD_DRAW_L_REG_DRAW_U_0C_POS               (16U)
#define OSD_DRAW_L_REG_DRAW_U_0C_LEN               (8U)
#define OSD_DRAW_L_REG_DRAW_U_0C_MSK               (((1U << OSD_DRAW_L_REG_DRAW_U_0C_LEN) - 1) << OSD_DRAW_L_REG_DRAW_U_0C_POS)
#define OSD_DRAW_L_REG_DRAW_U_0C_UMSK              (~(((1U << OSD_DRAW_L_REG_DRAW_U_0C_LEN) - 1) << OSD_DRAW_L_REG_DRAW_U_0C_POS))
#define OSD_DRAW_L_REG_DRAW_Y_0C                   OSD_DRAW_L_REG_DRAW_Y_0C
#define OSD_DRAW_L_REG_DRAW_Y_0C_POS               (24U)
#define OSD_DRAW_L_REG_DRAW_Y_0C_LEN               (8U)
#define OSD_DRAW_L_REG_DRAW_Y_0C_MSK               (((1U << OSD_DRAW_L_REG_DRAW_Y_0C_LEN) - 1) << OSD_DRAW_L_REG_DRAW_Y_0C_POS)
#define OSD_DRAW_L_REG_DRAW_Y_0C_UMSK              (~(((1U << OSD_DRAW_L_REG_DRAW_Y_0C_LEN) - 1) << OSD_DRAW_L_REG_DRAW_Y_0C_POS))

/* 0x98 : draw_partial_x_configc */
#define OSD_DRAW_L_DRAW_PARTIAL_X_CONFIGC_OFFSET (0x98)
#define OSD_DRAW_L_REG_DRAW_X_MIN_0C             OSD_DRAW_L_REG_DRAW_X_MIN_0C
#define OSD_DRAW_L_REG_DRAW_X_MIN_0C_POS         (0U)
#define OSD_DRAW_L_REG_DRAW_X_MIN_0C_LEN         (11U)
#define OSD_DRAW_L_REG_DRAW_X_MIN_0C_MSK         (((1U << OSD_DRAW_L_REG_DRAW_X_MIN_0C_LEN) - 1) << OSD_DRAW_L_REG_DRAW_X_MIN_0C_POS)
#define OSD_DRAW_L_REG_DRAW_X_MIN_0C_UMSK        (~(((1U << OSD_DRAW_L_REG_DRAW_X_MIN_0C_LEN) - 1) << OSD_DRAW_L_REG_DRAW_X_MIN_0C_POS))
#define OSD_DRAW_L_REG_DRAW_X_MAX_0C             OSD_DRAW_L_REG_DRAW_X_MAX_0C
#define OSD_DRAW_L_REG_DRAW_X_MAX_0C_POS         (16U)
#define OSD_DRAW_L_REG_DRAW_X_MAX_0C_LEN         (11U)
#define OSD_DRAW_L_REG_DRAW_X_MAX_0C_MSK         (((1U << OSD_DRAW_L_REG_DRAW_X_MAX_0C_LEN) - 1) << OSD_DRAW_L_REG_DRAW_X_MAX_0C_POS)
#define OSD_DRAW_L_REG_DRAW_X_MAX_0C_UMSK        (~(((1U << OSD_DRAW_L_REG_DRAW_X_MAX_0C_LEN) - 1) << OSD_DRAW_L_REG_DRAW_X_MAX_0C_POS))

/* 0x9C : draw_partial_y_configc */
#define OSD_DRAW_L_DRAW_PARTIAL_Y_CONFIGC_OFFSET (0x9C)
#define OSD_DRAW_L_REG_DRAW_Y_MIN_0C             OSD_DRAW_L_REG_DRAW_Y_MIN_0C
#define OSD_DRAW_L_REG_DRAW_Y_MIN_0C_POS         (0U)
#define OSD_DRAW_L_REG_DRAW_Y_MIN_0C_LEN         (11U)
#define OSD_DRAW_L_REG_DRAW_Y_MIN_0C_MSK         (((1U << OSD_DRAW_L_REG_DRAW_Y_MIN_0C_LEN) - 1) << OSD_DRAW_L_REG_DRAW_Y_MIN_0C_POS)
#define OSD_DRAW_L_REG_DRAW_Y_MIN_0C_UMSK        (~(((1U << OSD_DRAW_L_REG_DRAW_Y_MIN_0C_LEN) - 1) << OSD_DRAW_L_REG_DRAW_Y_MIN_0C_POS))
#define OSD_DRAW_L_REG_DRAW_Y_MAX_0C             OSD_DRAW_L_REG_DRAW_Y_MAX_0C
#define OSD_DRAW_L_REG_DRAW_Y_MAX_0C_POS         (16U)
#define OSD_DRAW_L_REG_DRAW_Y_MAX_0C_LEN         (11U)
#define OSD_DRAW_L_REG_DRAW_Y_MAX_0C_MSK         (((1U << OSD_DRAW_L_REG_DRAW_Y_MAX_0C_LEN) - 1) << OSD_DRAW_L_REG_DRAW_Y_MAX_0C_POS)
#define OSD_DRAW_L_REG_DRAW_Y_MAX_0C_UMSK        (~(((1U << OSD_DRAW_L_REG_DRAW_Y_MAX_0C_LEN) - 1) << OSD_DRAW_L_REG_DRAW_Y_MAX_0C_POS))

/* 0xA0 : draw_partial_yuv_configd */
#define OSD_DRAW_L_DRAW_PARTIAL_YUV_CONFIGD_OFFSET (0xA0)
#define OSD_DRAW_L_REG_DRAW_TH_0D                  OSD_DRAW_L_REG_DRAW_TH_0D
#define OSD_DRAW_L_REG_DRAW_TH_0D_POS              (0U)
#define OSD_DRAW_L_REG_DRAW_TH_0D_LEN              (8U)
#define OSD_DRAW_L_REG_DRAW_TH_0D_MSK              (((1U << OSD_DRAW_L_REG_DRAW_TH_0D_LEN) - 1) << OSD_DRAW_L_REG_DRAW_TH_0D_POS)
#define OSD_DRAW_L_REG_DRAW_TH_0D_UMSK             (~(((1U << OSD_DRAW_L_REG_DRAW_TH_0D_LEN) - 1) << OSD_DRAW_L_REG_DRAW_TH_0D_POS))
#define OSD_DRAW_L_REG_DRAW_V_0D                   OSD_DRAW_L_REG_DRAW_V_0D
#define OSD_DRAW_L_REG_DRAW_V_0D_POS               (8U)
#define OSD_DRAW_L_REG_DRAW_V_0D_LEN               (8U)
#define OSD_DRAW_L_REG_DRAW_V_0D_MSK               (((1U << OSD_DRAW_L_REG_DRAW_V_0D_LEN) - 1) << OSD_DRAW_L_REG_DRAW_V_0D_POS)
#define OSD_DRAW_L_REG_DRAW_V_0D_UMSK              (~(((1U << OSD_DRAW_L_REG_DRAW_V_0D_LEN) - 1) << OSD_DRAW_L_REG_DRAW_V_0D_POS))
#define OSD_DRAW_L_REG_DRAW_U_0D                   OSD_DRAW_L_REG_DRAW_U_0D
#define OSD_DRAW_L_REG_DRAW_U_0D_POS               (16U)
#define OSD_DRAW_L_REG_DRAW_U_0D_LEN               (8U)
#define OSD_DRAW_L_REG_DRAW_U_0D_MSK               (((1U << OSD_DRAW_L_REG_DRAW_U_0D_LEN) - 1) << OSD_DRAW_L_REG_DRAW_U_0D_POS)
#define OSD_DRAW_L_REG_DRAW_U_0D_UMSK              (~(((1U << OSD_DRAW_L_REG_DRAW_U_0D_LEN) - 1) << OSD_DRAW_L_REG_DRAW_U_0D_POS))
#define OSD_DRAW_L_REG_DRAW_Y_0D                   OSD_DRAW_L_REG_DRAW_Y_0D
#define OSD_DRAW_L_REG_DRAW_Y_0D_POS               (24U)
#define OSD_DRAW_L_REG_DRAW_Y_0D_LEN               (8U)
#define OSD_DRAW_L_REG_DRAW_Y_0D_MSK               (((1U << OSD_DRAW_L_REG_DRAW_Y_0D_LEN) - 1) << OSD_DRAW_L_REG_DRAW_Y_0D_POS)
#define OSD_DRAW_L_REG_DRAW_Y_0D_UMSK              (~(((1U << OSD_DRAW_L_REG_DRAW_Y_0D_LEN) - 1) << OSD_DRAW_L_REG_DRAW_Y_0D_POS))

/* 0xA4 : draw_partial_x_configd */
#define OSD_DRAW_L_DRAW_PARTIAL_X_CONFIGD_OFFSET (0xA4)
#define OSD_DRAW_L_REG_DRAW_X_MIN_0D             OSD_DRAW_L_REG_DRAW_X_MIN_0D
#define OSD_DRAW_L_REG_DRAW_X_MIN_0D_POS         (0U)
#define OSD_DRAW_L_REG_DRAW_X_MIN_0D_LEN         (11U)
#define OSD_DRAW_L_REG_DRAW_X_MIN_0D_MSK         (((1U << OSD_DRAW_L_REG_DRAW_X_MIN_0D_LEN) - 1) << OSD_DRAW_L_REG_DRAW_X_MIN_0D_POS)
#define OSD_DRAW_L_REG_DRAW_X_MIN_0D_UMSK        (~(((1U << OSD_DRAW_L_REG_DRAW_X_MIN_0D_LEN) - 1) << OSD_DRAW_L_REG_DRAW_X_MIN_0D_POS))
#define OSD_DRAW_L_REG_DRAW_X_MAX_0D             OSD_DRAW_L_REG_DRAW_X_MAX_0D
#define OSD_DRAW_L_REG_DRAW_X_MAX_0D_POS         (16U)
#define OSD_DRAW_L_REG_DRAW_X_MAX_0D_LEN         (11U)
#define OSD_DRAW_L_REG_DRAW_X_MAX_0D_MSK         (((1U << OSD_DRAW_L_REG_DRAW_X_MAX_0D_LEN) - 1) << OSD_DRAW_L_REG_DRAW_X_MAX_0D_POS)
#define OSD_DRAW_L_REG_DRAW_X_MAX_0D_UMSK        (~(((1U << OSD_DRAW_L_REG_DRAW_X_MAX_0D_LEN) - 1) << OSD_DRAW_L_REG_DRAW_X_MAX_0D_POS))

/* 0xA8 : draw_partial_y_configd */
#define OSD_DRAW_L_DRAW_PARTIAL_Y_CONFIGD_OFFSET (0xA8)
#define OSD_DRAW_L_REG_DRAW_Y_MIN_0D             OSD_DRAW_L_REG_DRAW_Y_MIN_0D
#define OSD_DRAW_L_REG_DRAW_Y_MIN_0D_POS         (0U)
#define OSD_DRAW_L_REG_DRAW_Y_MIN_0D_LEN         (11U)
#define OSD_DRAW_L_REG_DRAW_Y_MIN_0D_MSK         (((1U << OSD_DRAW_L_REG_DRAW_Y_MIN_0D_LEN) - 1) << OSD_DRAW_L_REG_DRAW_Y_MIN_0D_POS)
#define OSD_DRAW_L_REG_DRAW_Y_MIN_0D_UMSK        (~(((1U << OSD_DRAW_L_REG_DRAW_Y_MIN_0D_LEN) - 1) << OSD_DRAW_L_REG_DRAW_Y_MIN_0D_POS))
#define OSD_DRAW_L_REG_DRAW_Y_MAX_0D             OSD_DRAW_L_REG_DRAW_Y_MAX_0D
#define OSD_DRAW_L_REG_DRAW_Y_MAX_0D_POS         (16U)
#define OSD_DRAW_L_REG_DRAW_Y_MAX_0D_LEN         (11U)
#define OSD_DRAW_L_REG_DRAW_Y_MAX_0D_MSK         (((1U << OSD_DRAW_L_REG_DRAW_Y_MAX_0D_LEN) - 1) << OSD_DRAW_L_REG_DRAW_Y_MAX_0D_POS)
#define OSD_DRAW_L_REG_DRAW_Y_MAX_0D_UMSK        (~(((1U << OSD_DRAW_L_REG_DRAW_Y_MAX_0D_LEN) - 1) << OSD_DRAW_L_REG_DRAW_Y_MAX_0D_POS))

/* 0xAC : draw_partial_yuv_confige */
#define OSD_DRAW_L_DRAW_PARTIAL_YUV_CONFIGE_OFFSET (0xAC)
#define OSD_DRAW_L_REG_DRAW_TH_0E                  OSD_DRAW_L_REG_DRAW_TH_0E
#define OSD_DRAW_L_REG_DRAW_TH_0E_POS              (0U)
#define OSD_DRAW_L_REG_DRAW_TH_0E_LEN              (8U)
#define OSD_DRAW_L_REG_DRAW_TH_0E_MSK              (((1U << OSD_DRAW_L_REG_DRAW_TH_0E_LEN) - 1) << OSD_DRAW_L_REG_DRAW_TH_0E_POS)
#define OSD_DRAW_L_REG_DRAW_TH_0E_UMSK             (~(((1U << OSD_DRAW_L_REG_DRAW_TH_0E_LEN) - 1) << OSD_DRAW_L_REG_DRAW_TH_0E_POS))
#define OSD_DRAW_L_REG_DRAW_V_0E                   OSD_DRAW_L_REG_DRAW_V_0E
#define OSD_DRAW_L_REG_DRAW_V_0E_POS               (8U)
#define OSD_DRAW_L_REG_DRAW_V_0E_LEN               (8U)
#define OSD_DRAW_L_REG_DRAW_V_0E_MSK               (((1U << OSD_DRAW_L_REG_DRAW_V_0E_LEN) - 1) << OSD_DRAW_L_REG_DRAW_V_0E_POS)
#define OSD_DRAW_L_REG_DRAW_V_0E_UMSK              (~(((1U << OSD_DRAW_L_REG_DRAW_V_0E_LEN) - 1) << OSD_DRAW_L_REG_DRAW_V_0E_POS))
#define OSD_DRAW_L_REG_DRAW_U_0E                   OSD_DRAW_L_REG_DRAW_U_0E
#define OSD_DRAW_L_REG_DRAW_U_0E_POS               (16U)
#define OSD_DRAW_L_REG_DRAW_U_0E_LEN               (8U)
#define OSD_DRAW_L_REG_DRAW_U_0E_MSK               (((1U << OSD_DRAW_L_REG_DRAW_U_0E_LEN) - 1) << OSD_DRAW_L_REG_DRAW_U_0E_POS)
#define OSD_DRAW_L_REG_DRAW_U_0E_UMSK              (~(((1U << OSD_DRAW_L_REG_DRAW_U_0E_LEN) - 1) << OSD_DRAW_L_REG_DRAW_U_0E_POS))
#define OSD_DRAW_L_REG_DRAW_Y_0E                   OSD_DRAW_L_REG_DRAW_Y_0E
#define OSD_DRAW_L_REG_DRAW_Y_0E_POS               (24U)
#define OSD_DRAW_L_REG_DRAW_Y_0E_LEN               (8U)
#define OSD_DRAW_L_REG_DRAW_Y_0E_MSK               (((1U << OSD_DRAW_L_REG_DRAW_Y_0E_LEN) - 1) << OSD_DRAW_L_REG_DRAW_Y_0E_POS)
#define OSD_DRAW_L_REG_DRAW_Y_0E_UMSK              (~(((1U << OSD_DRAW_L_REG_DRAW_Y_0E_LEN) - 1) << OSD_DRAW_L_REG_DRAW_Y_0E_POS))

/* 0xB0 : draw_partial_x_confige */
#define OSD_DRAW_L_DRAW_PARTIAL_X_CONFIGE_OFFSET (0xB0)
#define OSD_DRAW_L_REG_DRAW_X_MIN_0E             OSD_DRAW_L_REG_DRAW_X_MIN_0E
#define OSD_DRAW_L_REG_DRAW_X_MIN_0E_POS         (0U)
#define OSD_DRAW_L_REG_DRAW_X_MIN_0E_LEN         (11U)
#define OSD_DRAW_L_REG_DRAW_X_MIN_0E_MSK         (((1U << OSD_DRAW_L_REG_DRAW_X_MIN_0E_LEN) - 1) << OSD_DRAW_L_REG_DRAW_X_MIN_0E_POS)
#define OSD_DRAW_L_REG_DRAW_X_MIN_0E_UMSK        (~(((1U << OSD_DRAW_L_REG_DRAW_X_MIN_0E_LEN) - 1) << OSD_DRAW_L_REG_DRAW_X_MIN_0E_POS))
#define OSD_DRAW_L_REG_DRAW_X_MAX_0E             OSD_DRAW_L_REG_DRAW_X_MAX_0E
#define OSD_DRAW_L_REG_DRAW_X_MAX_0E_POS         (16U)
#define OSD_DRAW_L_REG_DRAW_X_MAX_0E_LEN         (11U)
#define OSD_DRAW_L_REG_DRAW_X_MAX_0E_MSK         (((1U << OSD_DRAW_L_REG_DRAW_X_MAX_0E_LEN) - 1) << OSD_DRAW_L_REG_DRAW_X_MAX_0E_POS)
#define OSD_DRAW_L_REG_DRAW_X_MAX_0E_UMSK        (~(((1U << OSD_DRAW_L_REG_DRAW_X_MAX_0E_LEN) - 1) << OSD_DRAW_L_REG_DRAW_X_MAX_0E_POS))

/* 0xB4 : draw_partial_y_confige */
#define OSD_DRAW_L_DRAW_PARTIAL_Y_CONFIGE_OFFSET (0xB4)
#define OSD_DRAW_L_REG_DRAW_Y_MIN_0E             OSD_DRAW_L_REG_DRAW_Y_MIN_0E
#define OSD_DRAW_L_REG_DRAW_Y_MIN_0E_POS         (0U)
#define OSD_DRAW_L_REG_DRAW_Y_MIN_0E_LEN         (11U)
#define OSD_DRAW_L_REG_DRAW_Y_MIN_0E_MSK         (((1U << OSD_DRAW_L_REG_DRAW_Y_MIN_0E_LEN) - 1) << OSD_DRAW_L_REG_DRAW_Y_MIN_0E_POS)
#define OSD_DRAW_L_REG_DRAW_Y_MIN_0E_UMSK        (~(((1U << OSD_DRAW_L_REG_DRAW_Y_MIN_0E_LEN) - 1) << OSD_DRAW_L_REG_DRAW_Y_MIN_0E_POS))
#define OSD_DRAW_L_REG_DRAW_Y_MAX_0E             OSD_DRAW_L_REG_DRAW_Y_MAX_0E
#define OSD_DRAW_L_REG_DRAW_Y_MAX_0E_POS         (16U)
#define OSD_DRAW_L_REG_DRAW_Y_MAX_0E_LEN         (11U)
#define OSD_DRAW_L_REG_DRAW_Y_MAX_0E_MSK         (((1U << OSD_DRAW_L_REG_DRAW_Y_MAX_0E_LEN) - 1) << OSD_DRAW_L_REG_DRAW_Y_MAX_0E_POS)
#define OSD_DRAW_L_REG_DRAW_Y_MAX_0E_UMSK        (~(((1U << OSD_DRAW_L_REG_DRAW_Y_MAX_0E_LEN) - 1) << OSD_DRAW_L_REG_DRAW_Y_MAX_0E_POS))

/* 0xB8 : draw_partial_yuv_configf */
#define OSD_DRAW_L_DRAW_PARTIAL_YUV_CONFIGF_OFFSET (0xB8)
#define OSD_DRAW_L_REG_DRAW_TH_0F                  OSD_DRAW_L_REG_DRAW_TH_0F
#define OSD_DRAW_L_REG_DRAW_TH_0F_POS              (0U)
#define OSD_DRAW_L_REG_DRAW_TH_0F_LEN              (8U)
#define OSD_DRAW_L_REG_DRAW_TH_0F_MSK              (((1U << OSD_DRAW_L_REG_DRAW_TH_0F_LEN) - 1) << OSD_DRAW_L_REG_DRAW_TH_0F_POS)
#define OSD_DRAW_L_REG_DRAW_TH_0F_UMSK             (~(((1U << OSD_DRAW_L_REG_DRAW_TH_0F_LEN) - 1) << OSD_DRAW_L_REG_DRAW_TH_0F_POS))
#define OSD_DRAW_L_REG_DRAW_V_0F                   OSD_DRAW_L_REG_DRAW_V_0F
#define OSD_DRAW_L_REG_DRAW_V_0F_POS               (8U)
#define OSD_DRAW_L_REG_DRAW_V_0F_LEN               (8U)
#define OSD_DRAW_L_REG_DRAW_V_0F_MSK               (((1U << OSD_DRAW_L_REG_DRAW_V_0F_LEN) - 1) << OSD_DRAW_L_REG_DRAW_V_0F_POS)
#define OSD_DRAW_L_REG_DRAW_V_0F_UMSK              (~(((1U << OSD_DRAW_L_REG_DRAW_V_0F_LEN) - 1) << OSD_DRAW_L_REG_DRAW_V_0F_POS))
#define OSD_DRAW_L_REG_DRAW_U_0F                   OSD_DRAW_L_REG_DRAW_U_0F
#define OSD_DRAW_L_REG_DRAW_U_0F_POS               (16U)
#define OSD_DRAW_L_REG_DRAW_U_0F_LEN               (8U)
#define OSD_DRAW_L_REG_DRAW_U_0F_MSK               (((1U << OSD_DRAW_L_REG_DRAW_U_0F_LEN) - 1) << OSD_DRAW_L_REG_DRAW_U_0F_POS)
#define OSD_DRAW_L_REG_DRAW_U_0F_UMSK              (~(((1U << OSD_DRAW_L_REG_DRAW_U_0F_LEN) - 1) << OSD_DRAW_L_REG_DRAW_U_0F_POS))
#define OSD_DRAW_L_REG_DRAW_Y_0F                   OSD_DRAW_L_REG_DRAW_Y_0F
#define OSD_DRAW_L_REG_DRAW_Y_0F_POS               (24U)
#define OSD_DRAW_L_REG_DRAW_Y_0F_LEN               (8U)
#define OSD_DRAW_L_REG_DRAW_Y_0F_MSK               (((1U << OSD_DRAW_L_REG_DRAW_Y_0F_LEN) - 1) << OSD_DRAW_L_REG_DRAW_Y_0F_POS)
#define OSD_DRAW_L_REG_DRAW_Y_0F_UMSK              (~(((1U << OSD_DRAW_L_REG_DRAW_Y_0F_LEN) - 1) << OSD_DRAW_L_REG_DRAW_Y_0F_POS))

