RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/osd_draw_l_reg.h
    /* 0x14 : draw_partial_x_config1 */
    union {
        struct {
            uint32_t reg_draw_x_min_01 : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15    : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_draw_x_max_01 : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31    : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_x_config1;

    /* 0x18 : draw_partial_y_config1 */
    union {
        struct {
            uint32_t reg_draw_y_min_01 : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15    : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_draw_y_max_01 : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31    : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_y_config1;

    /* 0x1C : draw_partial_yuv_config2 */
    union {
        struct {
            uint32_t reg_draw_th_02 : 8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t reg_draw_v_02  : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t reg_draw_u_02  : 8; /* [23:16],        r/w,        0x0 */
            uint32_t reg_draw_y_02  : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_yuv_config2;

    /* 0x20 : draw_partial_x_config2 */
    union {
        struct {
            uint32_t reg_draw_x_min_02 : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15    : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_draw_x_max_02 : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31    : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_x_config2;

    /* 0x24 : draw_partial_y_config2 */
    union {
        struct {
            uint32_t reg_draw_y_min_02 : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15    : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_draw_y_max_02 : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31    : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_y_config2;

    /* 0x28 : draw_partial_yuv_config3 */
    union {
        struct {
            uint32_t reg_draw_th_03 : 8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t reg_draw_v_03  : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t reg_draw_u_03  : 8; /* [23:16],        r/w,        0x0 */
            uint32_t reg_draw_y_03  : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_yuv_config3;

    /* 0x2C : draw_partial_x_config3 */
    union {
        struct {
            uint32_t reg_draw_x_min_03 : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15    : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_draw_x_max_03 : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31    : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_x_config3;

    /* 0x30 : draw_partial_y_config3 */
    union {
        struct {
            uint32_t reg_draw_y_min_03 : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15    : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_draw_y_max_03 : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31    : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_y_config3;

    /* 0x34 : draw_partial_yuv_config4 */
    union {
        struct {
            uint32_t reg_draw_th_04 : 8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t reg_draw_v_04  : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t reg_draw_u_04  : 8; /* [23:16],        r/w,        0x0 */
            uint32_t reg_draw_y_04  : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_yuv_config4;

    /* 0x38 : draw_partial_x_config4 */
    union {
        struct {
            uint32_t reg_draw_x_min_04 : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15    : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_draw_x_max_04 : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31    : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_x_config4;

    /* 0x3C : draw_partial_y_config4 */
    union {
        struct {
            uint32_t reg_draw_y_min_04 : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15    : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_draw_y_max_04 : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31    : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_y_config4;

    /* 0x40 : draw_partial_yuv_config5 */
    union {
        struct {
            uint32_t reg_draw_th_05 : 8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t reg_draw_v_05  : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t reg_draw_u_05  : 8; /* [23:16],        r/w,        0x0 */
            uint32_t reg_draw_y_05  : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_yuv_config5;

    /* 0x44 : draw_partial_x_config5 */
    union {
        struct {
            uint32_t reg_draw_x_min_05 : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15    : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_draw_x_max_05 : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31    : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_x_config5;

    /* 0x48 : draw_partial_y_config5 */
    union {
        struct {
            uint32_t reg_draw_y_min_05 : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15    : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_draw_y_max_05 : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31    : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_y_config5;

